{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}B:\_YZU\01_teaching\investment\code\cm522\log/01_statistics of return.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Sep 2022, 17:07:28
{txt}
{com}. * first, change pwd to class folder
. use "data/Ret.dta" , clear
{txt}
{com}. 
. * Step 0. generate year and month from date
. ge year = year(date)
{txt}
{com}. ge month = month(date)
{txt}
{com}. 
. 
. * Step 1. Summary statistics
. 
. * Q1. How many year of data
. tab year

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1925 {c |}{res}        520        0.01        0.01
{txt}       1926 {c |}{res}      6,544        0.14        0.15
{txt}       1927 {c |}{res}      6,962        0.14        0.29
{txt}       1928 {c |}{res}      7,461        0.15        0.44
{txt}       1929 {c |}{res}      8,481        0.18        0.62
{txt}       1930 {c |}{res}      9,086        0.19        0.81
{txt}       1931 {c |}{res}      9,037        0.19        0.99
{txt}       1932 {c |}{res}      8,792        0.18        1.18
{txt}       1933 {c |}{res}      8,577        0.18        1.35
{txt}       1934 {c |}{res}      8,590        0.18        1.53
{txt}       1935 {c |}{res}      8,609        0.18        1.71
{txt}       1936 {c |}{res}      8,890        0.18        1.89
{txt}       1937 {c |}{res}      9,311        0.19        2.09
{txt}       1938 {c |}{res}      9,491        0.20        2.28
{txt}       1939 {c |}{res}      9,423        0.19        2.48
{txt}       1940 {c |}{res}      9,537        0.20        2.67
{txt}       1941 {c |}{res}      9,637        0.20        2.87
{txt}       1942 {c |}{res}      9,704        0.20        3.07
{txt}       1943 {c |}{res}      9,755        0.20        3.28
{txt}       1944 {c |}{res}      9,935        0.21        3.48
{txt}       1945 {c |}{res}     10,179        0.21        3.69
{txt}       1946 {c |}{res}     10,707        0.22        3.91
{txt}       1947 {c |}{res}     11,167        0.23        4.15
{txt}       1948 {c |}{res}     11,549        0.24        4.38
{txt}       1949 {c |}{res}     11,841        0.24        4.63
{txt}       1950 {c |}{res}     12,102        0.25        4.88
{txt}       1951 {c |}{res}     12,343        0.26        5.13
{txt}       1952 {c |}{res}     12,522        0.26        5.39
{txt}       1953 {c |}{res}     12,600        0.26        5.65
{txt}       1954 {c |}{res}     12,633        0.26        5.92
{txt}       1955 {c |}{res}     12,738        0.26        6.18
{txt}       1956 {c |}{res}     12,744        0.26        6.44
{txt}       1957 {c |}{res}     12,937        0.27        6.71
{txt}       1958 {c |}{res}     12,933        0.27        6.98
{txt}       1959 {c |}{res}     13,052        0.27        7.25
{txt}       1960 {c |}{res}     13,432        0.28        7.53
{txt}       1961 {c |}{res}     13,703        0.28        7.81
{txt}       1962 {c |}{res}     20,257        0.42        8.23
{txt}       1963 {c |}{res}     25,030        0.52        8.75
{txt}       1964 {c |}{res}     25,584        0.53        9.27
{txt}       1965 {c |}{res}     26,154        0.54        9.82
{txt}       1966 {c |}{res}     26,465        0.55       10.36
{txt}       1967 {c |}{res}     26,705        0.55       10.92
{txt}       1968 {c |}{res}     26,900        0.56       11.47
{txt}       1969 {c |}{res}     27,846        0.58       12.05
{txt}       1970 {c |}{res}     29,203        0.60       12.65
{txt}       1971 {c |}{res}     30,487        0.63       13.28
{txt}       1972 {c |}{res}     38,420        0.79       14.08
{txt}       1973 {c |}{res}     68,754        1.42       15.50
{txt}       1974 {c |}{res}     65,127        1.35       16.85
{txt}       1975 {c |}{res}     63,421        1.31       18.16
{txt}       1976 {c |}{res}     63,390        1.31       19.47
{txt}       1977 {c |}{res}     63,004        1.30       20.77
{txt}       1978 {c |}{res}     61,685        1.28       22.05
{txt}       1979 {c |}{res}     60,708        1.26       23.30
{txt}       1980 {c |}{res}     61,459        1.27       24.58
{txt}       1981 {c |}{res}     65,652        1.36       25.93
{txt}       1982 {c |}{res}     67,491        1.40       27.33
{txt}       1983 {c |}{res}     72,418        1.50       28.83
{txt}       1984 {c |}{res}     78,154        1.62       30.44
{txt}       1985 {c |}{res}     78,242        1.62       32.06
{txt}       1986 {c |}{res}     80,888        1.67       33.74
{txt}       1987 {c |}{res}     86,908        1.80       35.53
{txt}       1988 {c |}{res}     87,298        1.81       37.34
{txt}       1989 {c |}{res}     84,783        1.75       39.09
{txt}       1990 {c |}{res}     83,443        1.73       40.82
{txt}       1991 {c |}{res}     82,778        1.71       42.53
{txt}       1992 {c |}{res}     85,245        1.76       44.29
{txt}       1993 {c |}{res}     90,709        1.88       46.17
{txt}       1994 {c |}{res}     99,371        2.06       48.23
{txt}       1995 {c |}{res}    102,175        2.11       50.34
{txt}       1996 {c |}{res}    108,149        2.24       52.58
{txt}       1997 {c |}{res}    111,736        2.31       54.89
{txt}       1998 {c |}{res}    110,456        2.28       57.17
{txt}       1999 {c |}{res}    105,278        2.18       59.35
{txt}       2000 {c |}{res}    103,178        2.13       61.48
{txt}       2001 {c |}{res}     95,957        1.98       63.47
{txt}       2002 {c |}{res}     89,527        1.85       65.32
{txt}       2003 {c |}{res}     84,773        1.75       67.07
{txt}       2004 {c |}{res}     83,583        1.73       68.80
{txt}       2005 {c |}{res}     83,740        1.73       70.54
{txt}       2006 {c |}{res}     84,029        1.74       72.27
{txt}       2007 {c |}{res}     86,032        1.78       74.05
{txt}       2008 {c |}{res}     85,010        1.76       75.81
{txt}       2009 {c |}{res}     81,437        1.68       77.50
{txt}       2010 {c |}{res}     81,141        1.68       79.17
{txt}       2011 {c |}{res}     82,020        1.70       80.87
{txt}       2012 {c |}{res}     82,353        1.70       82.57
{txt}       2013 {c |}{res}     82,208        1.70       84.28
{txt}       2014 {c |}{res}     85,241        1.76       86.04
{txt}       2015 {c |}{res}     87,585        1.81       87.85
{txt}       2016 {c |}{res}     87,872        1.82       89.67
{txt}       2017 {c |}{res}     88,305        1.83       91.49
{txt}       2018 {c |}{res}     90,448        1.87       93.36
{txt}       2019 {c |}{res}     91,943        1.90       95.27
{txt}       2020 {c |}{res}     93,741        1.94       97.21
{txt}       2021 {c |}{res}    106,521        2.20       99.41
{txt}       2022 {c |}{res}     28,566        0.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}  4,834,507      100.00
{txt}
{com}. 
. * Q2. what is summary statistics (average, median, min, max) of returns
. su ret

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}ret {c |}{res}  4,674,744    1.040656    17.10564       -100       2400
{txt}
{com}. su ret, de

                             {txt}ret
{hline 61}
      Percentiles      Smallest
 1%    {res}-38.14433           -100
{txt} 5%    {res}-20.92166           -100
{txt}10%    {res}-14.14141           -100       {txt}Obs         {res}  4,674,744
{txt}25%    {res}    -5.75           -100       {txt}Sum of Wgt. {res}  4,674,744

{txt}50%    {res}        0                      {txt}Mean          {res} 1.040656
                        {txt}Largest       Std. Dev.     {res} 17.10564
{txt}75%    {res}     6.25       1760.465
{txt}90%    {res} 15.49296           1900       {txt}Variance      {res}  292.603
{txt}95%    {res} 24.29378       1988.359       {txt}Skewness      {res} 7.403817
{txt}99%    {res}       54           2400       {txt}Kurtosis      {res} 406.6546
{txt}
{com}. 
. * Q3. how many unique firms
. * if not installed: search distinct
. distinct permno

{txt}{col 9}{c |}        Observations
{col 9}{c |}      total   distinct
{hline 8}{c +}{hline 22}
 permno {c |}  {res}  4834507      36408
{txt}
{com}. 
. * Q4. mean of return over year
. tab year, su(ret)

            {txt}{c |}           Summary of ret
       year {c |}        Mean   Std. Dev.       Freq.
{hline 12}{c +}{hline 36}
       1926 {c |}  {res} .10965084   10.943746       6,257
  {txt}     1927 {c |}  {res} 2.3472493   13.296938       6,707
  {txt}     1928 {c |}  {res} 3.1558367   15.086528       7,188
  {txt}     1929 {c |}  {res} -3.096207   14.780599       8,069
  {txt}     1930 {c |}  {res}-3.5134713    16.64405       8,803
  {txt}     1931 {c |}  {res}-3.8337474   22.481922       8,756
  {txt}     1932 {c |}  {res} 3.4136023   38.168697       8,586
  {txt}     1933 {c |}  {res} 9.6576455   36.730023       8,415
  {txt}     1934 {c |}  {res} 2.0908545   19.151809       8,501
  {txt}     1935 {c |}  {res} 4.2232115    17.60631       8,464
  {txt}     1936 {c |}  {res} 3.7179947   14.726529       8,739
  {txt}     1937 {c |}  {res}-4.7352771   12.935583       9,164
  {txt}     1938 {c |}  {res}  3.634473   19.095572       9,400
  {txt}     1939 {c |}  {res} 1.1933463   22.996674       9,324
  {txt}     1940 {c |}  {res}-.28646761   13.239153       9,443
  {txt}     1941 {c |}  {res} -.5987607   12.754875       9,556
  {txt}     1942 {c |}  {res} 2.6876634   14.077489       9,640
  {txt}     1943 {c |}  {res} 4.3324006   15.360221       9,679
  {txt}     1944 {c |}  {res} 2.9163491   8.5967559       9,848
  {txt}     1945 {c |}  {res} 4.2469123   9.3458846      10,071
  {txt}     1946 {c |}  {res}-.68915018   10.175262      10,561
  {txt}     1947 {c |}  {res} .07976566   7.9442857      11,061
  {txt}     1948 {c |}  {res}-.02758355   9.1572375      11,465
  {txt}     1949 {c |}  {res} 1.7085328    7.656002      11,757
  {txt}     1950 {c |}  {res} 2.7454959   8.8692426      12,013
  {txt}     1951 {c |}  {res} 1.3153416   7.1870882      12,263
  {txt}     1952 {c |}  {res} .81902605   5.8540003      12,450
  {txt}     1953 {c |}  {res}-.20941546   5.9647037      12,539
  {txt}     1954 {c |}  {res} 3.8819779    7.917839      12,563
  {txt}     1955 {c |}  {res} 1.5652401   7.1477355      12,638
  {txt}     1956 {c |}  {res} .59511943   6.7649748      12,653
  {txt}     1957 {c |}  {res}-1.2378157   7.2916107      12,794
  {txt}     1958 {c |}  {res} 4.0139249   7.8124866      12,823
  {txt}     1959 {c |}  {res} 1.2294802   7.5660282      12,879
  {txt}     1960 {c |}  {res}-.06457969   8.1303949      13,233
  {txt}     1961 {c |}  {res} 2.2265206   8.5146462      13,505
  {txt}     1962 {c |}  {res}-.86550905    10.55333      18,226
  {txt}     1963 {c |}  {res} 1.2525526    9.653636      24,671
  {txt}     1964 {c |}  {res} 1.4088136   9.4531662      25,207
  {txt}     1965 {c |}  {res} 2.6286264   11.017148      25,751
  {txt}     1966 {c |}  {res} -.4438001   11.549261      26,098
  {txt}     1967 {c |}  {res} 4.9973268   13.359508      26,296
  {txt}     1968 {c |}  {res} 3.1121463   12.417682      26,341
  {txt}     1969 {c |}  {res}-2.2353404   11.397036      27,102
  {txt}     1970 {c |}  {res}-.65219907   13.975364      28,449
  {txt}     1971 {c |}  {res} 1.7060979    12.19062      29,597
  {txt}     1972 {c |}  {res} .46186598   11.028961      31,343
  {txt}     1973 {c |}  {res}-3.4892656   15.100221      66,320
  {txt}     1974 {c |}  {res}-2.2796259   15.944326      61,122
  {txt}     1975 {c |}  {res} 4.5300964   18.683193      58,981
  {txt}     1976 {c |}  {res}  3.592762   15.325905      59,199
  {txt}     1977 {c |}  {res} 1.8252967   12.519803      59,613
  {txt}     1978 {c |}  {res} 2.2216995   15.024489      58,360
  {txt}     1979 {c |}  {res} 3.0790357   14.021743      57,825
  {txt}     1980 {c |}  {res} 3.2737621   16.957856      58,271
  {txt}     1981 {c |}  {res} .05970985     14.7195      62,274
  {txt}     1982 {c |}  {res} 1.9481733   16.988609      64,390
  {txt}     1983 {c |}  {res} 2.6731923   17.738669      68,740
  {txt}     1984 {c |}  {res}-.97853851   14.801433      75,417
  {txt}     1985 {c |}  {res} 1.8913107   17.004638      75,387
  {txt}     1986 {c |}  {res} .59064824   17.956413      77,026
  {txt}     1987 {c |}  {res}-.42016516   19.026297      83,365
  {txt}     1988 {c |}  {res} 1.4921254   16.338165      84,743
  {txt}     1989 {c |}  {res} .96461012   16.330464      82,349
  {txt}     1990 {c |}  {res}-1.9283597   19.634767      81,211
  {txt}     1991 {c |}  {res}  3.507579   23.096385      80,187
  {txt}     1992 {c |}  {res} 2.0227726   22.476291      82,144
  {txt}     1993 {c |}  {res} 1.9839189   18.367559      86,869
  {txt}     1994 {c |}  {res} -.4365965   15.146497      96,076
  {txt}     1995 {c |}  {res} 2.2204497   16.474999      98,921
  {txt}     1996 {c |}  {res} 1.4090305   17.099641     104,546
  {txt}     1997 {c |}  {res} 1.5668083    17.26131     108,750
  {txt}     1998 {c |}  {res}-.11493118   22.000135     107,692
  {txt}     1999 {c |}  {res} 2.4937475   23.874172     101,889
  {txt}     2000 {c |}  {res}-.78913914   25.041853      99,696
  {txt}     2001 {c |}  {res} 1.9229514   25.862196      93,105
  {txt}     2002 {c |}  {res}-.92108571   20.339081      86,606
  {txt}     2003 {c |}  {res} 4.5782956   17.921619      81,646
  {txt}     2004 {c |}  {res} 1.6819313   14.304373      80,295
  {txt}     2005 {c |}  {res} .45746242   12.431111      80,745
  {txt}     2006 {c |}  {res} 1.4650325   12.157555      81,158
  {txt}     2007 {c |}  {res}-.26641831   12.302287      83,085
  {txt}     2008 {c |}  {res}-4.3595473   18.609026      83,119
  {txt}     2009 {c |}  {res} 4.4148209   24.029515      79,418
  {txt}     2010 {c |}  {res}  1.987772   14.151751      78,868
  {txt}     2011 {c |}  {res}-.72296432   13.338726      79,957
  {txt}     2012 {c |}  {res}  1.311744   12.766713      80,479
  {txt}     2013 {c |}  {res} 2.2628155   11.884474      80,162
  {txt}     2014 {c |}  {res} .24114963   11.768424      83,217
  {txt}     2015 {c |}  {res}-.57861542   14.869551      85,833
  {txt}     2016 {c |}  {res} 1.2539041   14.874705      86,399
  {txt}     2017 {c |}  {res}  1.218423   12.550576      86,657
  {txt}     2018 {c |}  {res}-1.0969755   13.474507      88,683
  {txt}     2019 {c |}  {res} 1.6859925   16.329097      90,354
  {txt}     2020 {c |}  {res} 2.2883784   23.148233      91,654
  {txt}     2021 {c |}  {res}  1.038233   18.175714     102,974
  {txt}     2022 {c |}  {res}-1.9620796   15.107088      28,079
{txt}{hline 12}{c +}{hline 36}
      Total {c |}  {res} 1.0406565   17.105641   4,674,744
{txt}
{com}. 
. * Q5. draw a plot for mean of return over year
. collapse (mean) ret, by(year)
{txt}
{com}. twoway (line ret year)
{res}{txt}
{com}. twoway (bar ret year)
{res}{txt}
{com}. 
. *close log file
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}B:\_YZU\01_teaching\investment\code\cm522\log/01_statistics of return.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Sep 2022, 17:07:42
{txt}{.-}
{smcl}
{txt}{sf}{ul off}