---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  B:\_YZU\01_teaching\investment\code\cm522\log/04_bm sorting.log
  log type:  text
 opened on:   4 Sep 2022, 17:47:19

. 
. * first, change pwd to class folder
. use "data/Main.dta" , clear

. 
. * merge with Bm
. merge 1:1 permno yyyymm using "data/Bm.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                       275,011
        from master                    52,885  (_merge==1)
        from using                    222,126  (_merge==2)

    matched                         4,781,622  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(275,011 observations deleted)

. drop _merge

. 
end of do-file

. keep if year >= 1964
(420,623 observations deleted)

. do "C:\Users\User\AppData\Local\Temp\STD00000000.tmp"

. asreg ret beta log_me bm, fmb newey(6)

Fama-MacBeth Two-Step procedure (Newey SE)       Number of obs     =   2561227
(Newey-West adj. Std. Err. using lags(6))        Num. time periods =       696
                                                 F(  3,   695)     =    199.74
                                                 Prob > F          =    0.0000
                                                 avg. R-squared    =    0.0813
                                                 Adj. R-squared    =    0.0806
------------------------------------------------------------------------------
             |              Newey-FMB
         ret |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .5306718   .2841334     1.87   0.062    -.0271909    1.088534
      log_me |   .0341398   .0323079     1.06   0.291    -.0292929    .0975725
          bm |   -1.79484   .0736058   -24.38   0.000    -1.939356   -1.650324
       _cons |  -.4538181   .2313737    -1.96   0.050    -.9080934    .0004572
------------------------------------------------------------------------------

. 
end of do-file

. asreg f1.ret beta log_me bm, fmb newey(6)
factor variables and time-series operators not allowed
r(101);

. ge ret_f1 = f1.ret
not sorted
r(5);

. sort permno t

. ge ret_f1 = f1.ret
(117,680 missing values generated)

. asreg ret_f1 beta log_me bm, fmb newey(6)

Fama-MacBeth Two-Step procedure (Newey SE)       Number of obs     =   2556195
(Newey-West adj. Std. Err. using lags(6))        Num. time periods =       696
                                                 F(  3,   695)     =      7.60
                                                 Prob > F          =    0.0001
                                                 avg. R-squared    =    0.0380
                                                 Adj. R-squared    =    0.0373
------------------------------------------------------------------------------
             |              Newey-FMB
      ret_f1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |  -.0205617     .12516    -0.16   0.870    -.2662988    .2251753
      log_me |   -.110703   .0385708    -2.87   0.004    -.1864322   -.0349737
          bm |   .2666016   .0699417     3.81   0.000     .1292792     .403924
       _cons |   1.854036   .2988198     6.20   0.000     1.267338    2.440733
------------------------------------------------------------------------------

. do "C:\Users\User\AppData\Local\Temp\STD00000000.tmp"

. reg ret beta log_me

      Source |       SS           df       MS      Number of obs   = 3,617,534
-------------+----------------------------------   F(2, 3617531)   =   4648.59
       Model |  2677151.83         2  1338575.92   Prob > F        =    0.0000
    Residual |  1.0417e+09 3,617,531  287.953271   R-squared       =    0.0026
-------------+----------------------------------   Adj R-squared   =    0.0026
       Total |  1.0444e+09 3,617,533  288.693161   Root MSE        =    16.969

------------------------------------------------------------------------------
         ret |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .8009335   .0117858    67.96   0.000     .7778338    .8240333
      log_me |   .2936469    .003936    74.61   0.000     .2859325    .3013613
       _cons |  -.9887364    .025078   -39.43   0.000    -1.037888   -.9395845
------------------------------------------------------------------------------

. 
end of do-file

. asreg ret_f1 beta log_me, fmb newey(6)

Fama-MacBeth Two-Step procedure (Newey SE)       Number of obs     =   3607236
(Newey-West adj. Std. Err. using lags(6))        Num. time periods =       696
                                                 F(  2,   695)     =      7.06
                                                 Prob > F          =    0.0009
                                                 avg. R-squared    =    0.0326
                                                 Adj. R-squared    =    0.0324
------------------------------------------------------------------------------
             |              Newey-FMB
      ret_f1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        beta |   .0181557   .1403542     0.13   0.897    -.2574134    .2937248
      log_me |  -.1325339   .0352817    -3.76   0.000    -.2018055   -.0632623
       _cons |   1.681081   .2677338     6.28   0.000     1.155417    2.206745
------------------------------------------------------------------------------

